package by.academy.lesson17.classwork;

public class ProblemDemo {
//	1. Сгенерировать 1000 чисел в диапазоне от 0 до 1000. 
//	2. Отсортировать числа.
//	3. Нужно пропустить первые 50 элементов.
//	4. Оставить только четные числа.
//	5. Оставить только уникальные значения.
//	6. Преобразовать в строки в формате: "Число " + n
//	7. Органичить количество элементов 200.
//	8. Сгенерировать List из получившихся чисел
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
